# End Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkIterator..::..End Method
MEPNetworkIterator Class See Also
---
Checks if the network iteration has completed.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public bool End()
```

Visual Basic
---
```text
Public Function End As Boolean
```

Visual C++
---
```text
public:
bool End()
```

# ### Return Value
True if all analytical segments and nodes have been visited, otherwise false.
# See Also
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace